{
  "The Alchemist": {
    "themes": "Personal growth, Destiny, Omens",
    "audience": "Dreamers, spiritual seekers, travelers",
    "background": "Santiago, a young Andalusian shepherd, dreams of a hidden treasure near the Egyptian pyramids. He embarks on a journey across the desert to fulfill this dream. Along the way, he encounters mentors and challenges that shape his path. The story is a metaphor for finding one's true purpose.",
    "insight": "Teaches that listening to one's heart is the key to achieving one’s Personal Legend.",
    "funFact": "Translated into more than 80 languages, making it one of the most translated books by a living author.",
    "summary": "A philosophical fable that inspires readers to pursue their dreams. Through allegory and mysticism, Coelho crafts a timeless message about destiny and self-discovery. The simplicity of its language adds to its universal appeal. A modern classic for those seeking purpose."
  },
  "Sapiens: A Brief History of Humankind": {
    "themes": "Human history, Cognitive revolution, Social constructs",
    "audience": "Non-fiction lovers, history geeks, philosophers",
    "background": "The book explores how Homo sapiens evolved from hunter-gatherers to dominant beings. It dissects the cognitive, agricultural, and industrial revolutions. Harari analyzes how myths and institutions shape societies. Each chapter challenges long-held historical beliefs.",
    "insight": "Presents bold ideas on culture, religion, and economics that reshape how we view our species.",
    "funFact": "Originally self-published in Hebrew before becoming an international bestseller.",
    "summary": "A sweeping narrative that redefines how we understand humanity’s past. Harari blends science and philosophy to explain the development of cultures and systems. The book is both enlightening and provocative. A must-read for those questioning the human condition."
  },
  "The Martian": {
    "themes": "Survival, Innovation, Isolation",
    "audience": "STEM lovers, space fans, engineers",
    "background": "Astronaut Mark Watney is stranded alone on Mars after a botched mission. Declared dead by NASA, he must use his knowledge to survive. He grows food, generates water, and engineers life-saving tools. His journey becomes a fight between human will and hostile environment.",
    "insight": "Merges humor and hard science to create a believable survival narrative.",
    "funFact": "NASA consulted the author during the film adaptation for scientific accuracy.",
    "summary": "An exhilarating blend of humor and high-stakes survival set in space. Andy Weir turns science into suspense, making complex ideas approachable. Watney’s resilience and sarcasm make him an unforgettable character. A celebration of human ingenuity against the odds."
  },
  "The Shining": {
    "themes": "Madness, Isolation, Supernatural forces",
    "audience": "Horror fans, thriller seekers, Stephen King readers",
    "background": "Jack Torrance moves with his family to an isolated hotel for the winter. As the caretaker, he hopes to find peace and focus on writing. However, the hotel's dark past begins to unravel his sanity. His descent into madness puts his family in danger.",
    "insight": "Explores the vulnerabilities of the mind under supernatural stress.",
    "funFact": "Stephen King disliked Stanley Kubrick’s adaptation of the book.",
    "summary": "A chilling psychological horror that examines the descent into insanity. Stephen King crafts a haunting narrative filled with suspense and dread. The Overlook Hotel becomes a character of its own. A must-read for horror enthusiasts."
  },
  "Becoming": {
    "themes": "Identity, Empowerment, Resilience",
    "audience": "Women, memoir lovers, leadership aspirants",
    "background": "Michelle Obama recounts her life from childhood on the South Side of Chicago to the White House. She discusses education, relationships, and personal growth. Her narrative reveals behind-the-scenes experiences as First Lady. The memoir inspires readers to find and use their voice.",
    "insight": "Celebrates self-discovery and shaping your own narrative.",
    "funFact": "Became the best-selling book in the U.S. in 2018.",
    "summary": "A heartfelt and honest memoir from one of the most iconic First Ladies. Michelle Obama shares her journey with grace and strength. It's a celebration of perseverance and hope. An empowering read for anyone seeking inspiration."
  },
  "The Fault in Our Stars": {
    "themes": "Young love, Mortality, Illness",
    "audience": "Teens, romantics, contemporary readers",
    "background": "Hazel Grace Lancaster meets Augustus Waters at a cancer support group. Their bond forms over shared experiences and love for literature. They travel to meet a reclusive author, discovering more about life and death. Their love story is touching and tragic.",
    "insight": "Balances wit and melancholy with authentic teenage voices.",
    "funFact": "John Green was inspired by his time as a student chaplain.",
    "summary": "A tender and emotional love story that doesn't shy away from life's hardest truths. John Green delivers humor and heartbreak with authenticity. The characters’ dialogue is witty and moving. A poignant tale of love and loss."
  },
  "Norwegian Wood": {
    "themes": "Melancholy, Memory, Young adulthood",
    "audience": "Literary fiction enthusiasts, Murakami fans",
    "background": "Toru Watanabe recalls his college days in Tokyo after hearing a Beatles song. He navigates love, loss, and existential angst. The story focuses on his relationships with emotionally fragile individuals. It reflects the pain and beauty of coming of age.",
    "insight": "Explores deep emotional trauma with haunting prose.",
    "funFact": "The novel made Murakami a household name in Japan.",
    "summary": "A poignant exploration of memory and longing. Murakami weaves a delicate tale of love and sorrow. The novel’s introspective tone resonates with readers facing emotional crossroads. It's a deeply personal and lyrical work."
  },
  "Educated": {
    "themes": "Self-determination, Family, Transformation",
    "audience": "Autobiography fans, educators, feminists",
    "background": "Tara Westover grows up in a survivalist, isolated family in Idaho. With no formal schooling, she teaches herself enough to attend college. Eventually, she earns a PhD from Cambridge. Her story is one of resilience and the pursuit of knowledge.",
    "insight": "A powerful testament to the transformative power of education.",
    "funFact": "She didn’t enter a classroom until she was 17.",
    "summary": "A gripping memoir about breaking free from a rigid and controlling upbringing. Westover’s journey is both inspiring and harrowing. Her thirst for education opens doors to self-liberation. A raw, courageous account of transformation."
  },
  "The Silent Patient": {
    "themes": "Silence, Trauma, Obsession",
    "audience": "Thriller lovers, mystery fans, modern readers",
    "background": "Alicia Berenson, a famous painter, shoots her husband and stops speaking. Theo Faber, a psychotherapist, is obsessed with uncovering her motive. He joins the institution where she’s held. The story unfolds in a suspenseful and twisty narrative.",
    "insight": "Tightly plotted psychological suspense with an unforgettable twist.",
    "funFact": "Was the best-selling debut novel of 2019.",
    "summary": "A dark and suspenseful psychological thriller. The novel keeps readers guessing with its layered narrative. Alicia’s silence becomes a mystery begging to be solved. The shocking ending leaves a lasting impression."
  },
  "Circe": {
    "themes": "Mythology, Power, Isolation",
    "audience": "Fans of Greek myths, fantasy, strong female leads",
    "background": "Circe, daughter of Helios, is banished to a remote island after defying the gods. There, she hones her magical abilities and interacts with legendary figures. Through centuries of solitude and conflict, she finds her own strength. This is a feminist retelling of a mythological life.",
    "insight": "Blends myth and feminism into a deeply human narrative.",
    "funFact": "Won the Goodreads Choice Award for Best Fantasy.",
    "summary": "An enchanting retelling that brings new life to Greek mythology. Circe’s journey from exile to empowerment is beautifully told. Madeline Miller crafts a tale of transformation and defiance. A lush and lyrical novel of identity and power."
  },
  "Atomic Habits": {
    "themes": "Habits, Self-improvement, Consistency",
    "audience": "Productivity seekers, professionals, athletes",
    "background": "James Clear offers a framework for creating good habits and eliminating bad ones. The book emphasizes small, consistent changes over time. He uses psychology and case studies to back his strategies. It’s practical, actionable, and motivating.",
    "insight": "Stresses tiny changes that yield remarkable results over time.",
    "funFact": "Used by Fortune 500 CEOs and pro sports coaches.",
    "summary": "A pragmatic guide to mastering daily habits. Clear’s approach simplifies behavior change using atomic principles. It's packed with real-world examples and tactics. Perfect for anyone serious about personal growth."
  },
  "The Midnight Library": {
    "themes": "Regret, Possibility, Mental health",
    "audience": "Philosophical readers, life-questioners, fiction fans",
    "background": "Nora Seed finds herself in a mystical library between life and death. Each book offers a glimpse into a different version of her life. She explores the choices she could have made. It’s a journey through regrets and what it means to live fully.",
    "insight": "Poses the question: “What if you had chosen differently?”",
    "funFact": "Inspired by author Matt Haig’s own mental health journey.",
    "summary": "A moving story about second chances and unrealized dreams. Matt Haig explores the weight of regrets and the beauty of possibility. Nora’s introspective journey resonates with readers facing doubt. A hopeful and thoughtful read."
  },
  "The Seven Husbands of Evelyn Hugo": {
    "themes": "Fame, Love, Secrets",
    "audience": "Historical fiction fans, romance readers",
    "background": "Aging Hollywood icon Evelyn Hugo decides to tell her life story. She chooses an unknown journalist, Monique, for reasons that unfold slowly. Evelyn recounts her rise to fame and the love behind each of her seven marriages. The story is layered with emotion, ambition, and revelation.",
    "insight": "Explores identity, bisexuality, and sacrifices for stardom.",
    "funFact": "Inspired by real-life Hollywood actresses.",
    "summary": "A glamorous yet intimate portrait of a complex woman. Taylor Jenkins Reid blends Old Hollywood charm with modern themes. Evelyn’s story is one of love, ambition, and reinvention. A captivating tale with emotional depth."
  },
  "Project Hail Mary": {
    "themes": "Ingenuity, Sacrifice, First Contact",
    "audience": "Sci-fi readers, science geeks, Andy Weir fans",
    "background": "Ryland Grace wakes up alone in space with no memory. He soon remembers he’s on a mission to save Earth from an extinction-level threat. Along the way, he meets an unexpected alien ally. Together, they work to solve a cosmic crisis.",
    "insight": "Equal parts suspense, humor, and science.",
    "funFact": "Written by the author of The Martian and even more complex.",
    "summary": "An exhilarating science fiction adventure filled with heart. Andy Weir delivers clever puzzles and compelling characters. Grace’s bond with an alien adds emotional and comedic layers. A brilliant mix of science, survival, and friendship."
  },
  "The Subtle Art of Not Giving a F*ck": {
    "themes": "Values, Perspective, Anti-positivity",
    "audience": "Young adults, skeptics, self-help readers",
    "background": "Mark Manson challenges the norms of traditional self-help. He argues that life is limited, and we should choose our struggles wisely. Through personal anecdotes and blunt wisdom, he promotes acceptance over blind positivity. It's about finding meaning in discomfort.",
    "insight": "Encourages facing struggles instead of avoiding them.",
    "funFact": "One of the most unconventional self-help books.",
    "summary": "A counterintuitive guide to living a meaningful life. Manson’s no-nonsense tone shakes up the self-help genre. It’s refreshing, funny, and unapologetically real. Perfect for those tired of sugar-coated advice."
  },
  "The Henna Artist": {
    "themes": "Tradition, Independence, Secrets",
    "audience": "Cultural fiction lovers, historical fans",
    "background": "Set in 1950s Jaipur, Lakshmi escapes an abusive marriage to become a sought-after henna artist. She builds a new life among the city’s elite while hiding her past. When her estranged sister appears, her secrets threaten to unravel. The story explores autonomy and reinvention.",
    "insight": "Celebrates female resilience amid tradition.",
    "funFact": "Reese Witherspoon picked it for her book club.",
    "summary": "A vibrant and emotional tale of self-discovery in post-independence India. The novel paints rich cultural landscapes. Alka Joshi crafts a heroine full of grace and strength. A compelling read on empowerment and identity."
  },
  "Where the Crawdads Sing": {
    "themes": "Loneliness, Nature, Justice",
    "audience": "Mystery fans, nature lovers, Southern fiction readers",
    "background": "Kya Clark, abandoned as a child, grows up alone in the North Carolina marshes. She becomes deeply connected to nature and shunned by society. When a man is found dead, she becomes the prime suspect. The story blends mystery with a coming-of-age arc.",
    "insight": "Combines lyrical nature writing with courtroom drama.",
    "funFact": "The author was a wildlife scientist for 30 years.",
    "summary": "A haunting tale set against the backdrop of the wild. Delia Owens explores human isolation and resilience. The novel’s poetic descriptions of nature are unforgettable. Both a whodunit and a survival story."
  },
  "A Man Called Ove": {
    "themes": "Grumpiness, Kindness, Community",
    "audience": "Fans of heartwarming fiction, introverts",
    "background": "Ove is a curmudgeonly man with strict routines and a gruff demeanor. After his wife’s death, he’s ready to give up on life. Unexpected friendships with his new neighbors start to shift his worldview. Slowly, he reconnects with life and love.",
    "insight": "Explores how loneliness can turn into connection.",
    "funFact": "The author wrote it while grieving his father.",
    "summary": "A touching and humorous story of second chances. Fredrik Backman masterfully balances wit and sentiment. Ove’s transformation is slow, believable, and beautiful. A heartfelt tribute to unexpected community."
  },
  "The Book Thief": {
    "themes": "War, Words, Humanity",
    "audience": "YA readers, historical fans, bibliophiles",
    "background": "Narrated by Death, the novel follows Liesel, a young girl in Nazi Germany. She steals books and shares them during the horrors of war. Her relationships with her foster family and a Jewish man in hiding shape her. It’s a tale of resistance through stories.",
    "insight": "Celebrates the power of words in dark times.",
    "funFact": "The novel spent 230+ weeks on the NYT Best Seller list.",
    "summary": "A powerful and poetic look at humanity amid chaos. Markus Zusak’s use of Death as a narrator is haunting and unique. The novel honors storytelling as a form of survival. Emotional, beautiful, and unforgettable."
  },
  "The House in the Cerulean Sea": {
    "themes": "Found family, Acceptance, Whimsy",
    "audience": "Fantasy readers, LGBTQ+ audience, feel-good seekers",
    "background": "Linus Baker is a rule-abiding caseworker who inspects magical orphanages. He’s sent to an unusual home on a remote island. There, he meets magical children and their eccentric caretaker. The experience transforms his understanding of love and belonging.",
    "insight": "A cozy fantasy about love and inclusion.",
    "funFact": "Described as “a hug in book form.”",
    "summary": "A heartwarming and whimsical fantasy. TJ Klune crafts a charming story of compassion and growth. The book celebrates difference and chosen families. It’s comforting, delightful, and emotionally rich."
  }
}
